package by.iba.markovsky.festival.constant;

public interface RegEx {
    String LOGIN = "^[A-Za-z][A-Za-z0-9_]{2,19}$";
    String PASSWORD = "^[A-Za-z0-9]{3,20}$";
    String EMAIL = "^[a-zA-Z0-9.!#$%&'*+/=?^_`{|}~-]+@[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(?:\\.[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$";
    String TELEPHONE = "^((17)|(29)|(33)|(44)|(25))([1-9][0-9]{6})$";
    String TELEPHONE_ALTERNATIVE = "^(80|\\+375)[\\s|-]?(17|29|33|44|25)[\\s|-]?([\\s|-]?\\d{2,3})+$";

    String UNIQUE_NAME = "^([А-ЯЁ][а-яё]{0,9}([\\-][А-ЯЁ][а-яё]{0,9}){0,1})|([A-Z][a-z]{0,9}([\\-][A-Z][a-z]{0,9}){0,1})$";

    String ADDRESS = "^((ул\\.\\s)|(просп\\.\\s)|(пер\\.\\s)|(бульвар\\s))([А-ЯЁ][а-яё]{0,20}([\\-][А-ЯЁ][а-яё]{0,20}){0,1})(\\s)([1-9][0-9]{0,3}(\\-[1-5]){0,1})$";
    String CAPACITY = "^[1-9][0-9]{0,5}$";

    String NAME = "^[А-ЯЁ][а-яё]{0,9}([\\-][А-ЯЁ][а-яё]{0,9}){0,1}$";
    String SURNAME = "^[А-ЯЁ][а-яё]{0,9}([\\-][А-ЯЁ][а-яё]{0,9}){0,1}$";
    String AGE = "^[1-9][0-9]{0,2}$";

    String GENRE = "^([А-ЯЁ][а-яё]{0,9}([\\-][А-ЯЁ][а-яё]{0,9}){0,1})|([A-Z][a-z]{0,9}([\\-][A-Z][a-z]{0,9}){0,1})$";
}
